Pipe_3D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 7e-3;

boundaryField
{
    inlet_1
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet_2
    {
        type            fixedValue;
        value           $internalField;
    }
 
    outlet
    {
        type            zeroGradient;
    }
    pipe
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
